coupled_simulation/shared/tutorials/coupled_simulation/fluid-openfoam/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1;

deltaT          0.005;

writeControl    runTime;

writeInterval   0.01;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

/*
libs ("/usr/lib/openfoam/openfoam2306/platforms/linuxARM64GccDPInt32Opt/lib/libpreciceAdapterFunctionObject.so");

functions
{
    preCICE_Adapter
    {
        type preciceAdapterFunctionObject;
        errors strict; // Available since OpenFOAM v2012
    }
}
*/

libs ("/usr/lib/openfoam/openfoam2306/platforms/linuxARM64GccDPInt32Opt/lib/libpreciceAdapterFunctionObject.so");


functions
{
    precice
    {
        type          preciceAdapterFunctionObject;
        enabled       true;
        preciceDict   "system/preciceDict";
    }
}